{
  "plugins": {
    "Comment.nvim": {
      "src": "https://github.com/numToStr/Comment.nvim",
      "version": "'v0.8.0'"
    },
    "OSC11.nvim": {
      "src": "https://github.com/afonsofrancof/OSC11.nvim"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": "'v1.9.1'"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": "'v9.1.0'"
    },
    "diffview.nvim": {
      "src": "https://github.com/dlyongemallo/diffview.nvim",
      "version": "'f81170ee78304944fc1dba1141d371a6811ee38a'"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets",
      "version": "'572f5660cf05f8cd8834e096d7b4c921ba18e175'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": "'v2.0.0'"
    },
    "guess-indent.nvim": {
      "src": "https://github.com/NMAC427/guess-indent.nvim",
      "version": "'84a4987ff36798c2fc1169cbaff67960aed9776f'"
    },
    "kanagawa.nvim": {
      "src": "https://github.com/rebelot/kanagawa.nvim"
    },
    "leap.nvim": {
      "src": "https://git.disroot.org/andyg/leap.nvim",
      "version": "'156c71aabb68d520c6269db4103c8e5580e3ea67'"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim",
      "version": "'v2.1.0'"
    },
    "mason-tool-installer.nvim": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim",
      "version": "'517ef5994ef9d6b738322664d5fdd948f0fdeb46'"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim",
      "version": "'v2.2.1'"
    },
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons",
      "version": "'v0.17.0'"
    },
    "neotest": {
      "src": "https://github.com/nvim-neotest/neotest"
    },
    "neotest-jest": {
      "src": "https://github.com/nvim-neotest/neotest-jest"
    },
    "neotest-vitest": {
      "src": "https://github.com/marilari88/neotest-vitest"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs",
      "version": "'0.10.0'"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "'v2.6.0'"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround",
      "version": "'v4.0.2'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context",
      "version": "'v1.0.0'"
    },
    "nvim-ts-autotag": {
      "src": "https://github.com/windwp/nvim-ts-autotag",
      "version": "'8e1c0a389f20bf7f5b0dd0e00306c1247bda2595'"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim",
      "version": "'v2.15.0'"
    },
    "openingh.nvim": {
      "src": "https://github.com/Almo7aya/openingh.nvim",
      "version": "'v1.0.14'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "rose-pine": {
      "src": "https://github.com/rose-pine/neovim",
      "version": "'v3.0.2'"
    },
    "sidekick.nvim": {
      "src": "https://github.com/folke/sidekick.nvim"
    },
    "smart-splits.nvim": {
      "src": "https://github.com/mrjones2014/smart-splits.nvim"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim",
      "version": "'v2.30.0'"
    },
    "tiny-inline-diagnostic.nvim": {
      "src": "https://github.com/rachartier/tiny-inline-diagnostic.nvim",
      "version": "'ecce93ff7db4461e942c03e0fcc64bd785df4057'"
    },
    "tsc.nvim": {
      "src": "https://github.com/dmmulroy/tsc.nvim",
      "version": "'v2.10.1'"
    },
    "vim-obsession": {
      "src": "https://github.com/tpope/vim-obsession",
      "version": "'ed9dfc7c2cc917ace8b24f4f9f80a91e05614b63'"
    },
    "zpack.nvim": {
      "src": "https://github.com/zuqini/zpack.nvim",
      "version": "'1cf8b96595408d9fb5f645f8f3b3c822b0dbea03'"
    }
  }
}
